require_relative '../parser/info_parser'

infobox1 = <<TEXT
{{基礎情報 会社
|社名=株式会社ニワンゴ
|英文社名=niwango,inc.
|ロゴ=[[画像:Niwango logo.png|167px]]
|種類=[[株式会社]]
|市場情報=
|略称=
|国籍={{JPN}}
|本社郵便番号=
|本社所在地=[[東京都]][[渋谷区]][[神宮前]]一丁目15番2号<br/>ニコニコ本社ビル
|設立=[[2005年]][[11月14日]]
|業種=情報・通信業
|統一金融機関コード=
|SWIFTコード=
|事業内容=携帯電話メールによるコンテンツ・情報配信サービスの企画・制作・運営および動画投稿共有サイトの運営等
|代表者=[[川上量生]]（[[代表取締役]][[会長]]）<br />[[杉本誠司]]（代表取締役[[社長]]）
|資本金=9000万円（2010年9月30日時点）
|発行済株式総数=
|売上高=
|営業利益=
|純利益=9156万4000円（2010年9月期）
|純資産=1129万7000円（2010年9月30日時点）
|総資産=4400万円（2010年9月30日時点）
|従業員数=
|決算期=[[9月30日|9月末日]]
|主要株主=[[ドワンゴ]] 75.1%<br />[[未来検索ブラジル]] 19.9%<br/>[[CELL]] 5%
|主要子会社=
|関係する人物=[[西村博之]]（元[[取締役]]）
|外部リンク=http://niwango.jp/
|特記事項=[[ドワンゴ]]の系列企業
}}
TEXT

infobox2 = <<TEXT
{{Infobox_Company |
 company_name_zh =中国移动有限公司|
 company_name =中国移动有限公司|
 company_logo =[[File:Chinamobile.png|175px]]|
 company_type =[[上市公司]]|
 market_information ={{sehk|0941}}<br />{{nyse|CHL}}|
 company_slogan =沟通从心开始；移动信息专家；正德厚生 臻于至善|
 foundation =[[1997年]][[9月3日]]|
 location =[[中国]][[北京市]][[西城区]]金融街29号|
 industry =[[電訊]]|
 key_people =公司[[总经理]]：[[李跃]]|
 sales = 电信网络运营、電信增值服務|
 profit ={{increase}}1259億元人民幣(2011年)|
 asset =5634.93億元人民幣(2007年)|
 market_value =約15595億港元(2008年12月31日)|
 num_employees =145954人(截止2009年末)|
 products =|
 revenue ={{increase}}5280億元人民幣(2011年)|
 homepage = 10086.cn|
}}
TEXT

infobox3 = <<TEXT
{{行政官庁
|国名 = {{Flagicon|JPN|size=20px}} [[日本]]
|正式名称 = 内閣府
|紋章 = Go-shichi no kiri crest.svg
|紋章サイズ = 100px
|画像 = Naikakufu1.jpg
|画像サイズ = 200px
|画像説明 = 内閣府庁舎
|主席閣僚職名 = 担当閣僚
|主席閣僚氏名 = [[安倍晋三]]（[[内閣総理大臣]]）<br/>[[菅義偉]]（[[内閣官房長官]]）<br/>[[内閣府特命担当大臣]]（下記）
|次席閣僚職名 = [[内閣府副大臣|副大臣]]
|次席閣僚氏名 = [[西村康稔]]<br/>[[伊達忠一]]<br/>[[寺田稔]]（[[復興副大臣]]）<br/>[[坂本哲志]]（[[総務副大臣]]）<br/>[[赤羽一嘉]]（[[経済産業副大臣]]）<br/>[[井上信治]]（[[環境副大臣]]）
|補佐官職名 = [[内閣府大臣政務官|大臣政務官]]
|補佐官氏名 = [[山際大志郎]]<br/>[[亀岡偉民]]（[[復興大臣政務官]]）<br/>[[島尻安伊子]]（[[復興大臣政務官]]）<br/>[[北村茂男]]（[[総務大臣政務官]]）<br/>[[平将明]]（[[経済産業大臣政務官]]）<br/>[[秋野公造]]（[[環境大臣政務官]]）
|次官職名 = [[事務次官]]
|次官氏名 = [[松元崇]]
|上部組織 = 上部組織
|上部組織概要 = [[内閣 (日本)|内閣]]
|下部組織1 = [[内部部局]]
|下部組織概要1 = [[内閣府大臣官房|大臣官房]]、[[政策統括官]]、[[賞勲局]]、[[男女共同参画局]]、[[沖縄振興局]]
|下部組織2 = [[重要政策に関する会議|重要政策に<br/>関する会議]]
|下部組織概要2 = [[経済財政諮問会議]]、[[総合科学技術会議]]、[[中央防災会議]]、[[男女共同参画会議]]
|下部組織3 = [[審議会等]]
|下部組織概要3 = [[民間資金等活用事業推進委員会]]、[[官民競争入札等監理委員会]]、[[食品安全委員会]]、[[独立行政法人評価委員会]]、[[公文書管理委員会]]、[[障害者政策委員会]]、[[原子力委員会]]、[[地方制度調査会]]、[[選挙制度審議会]]、[[衆議院議員選挙区画定審議会]]、[[国会等移転審議会]]、[[統計委員会]]、[[情報公開・個人情報保護審査会]]、[[公益認定等委員会]]、[[再就職等監視委員会]]、[[消費者委員会]]、[[宇宙政策委員会]]、[[沖縄振興審議会]]、[[地方分権改革推進委員会]]
|下部組織4 = [[施設等機関]]
|下部組織概要4 = [[経済社会総合研究所]]、[[迎賓館]]
|下部組織5 = [[特別の機関]] 
|下部組織概要5 = [[北方対策本部]]、[[金融危機対応会議]]、[[民間資金等活用事業推進会議]]、[[子ども・若者育成支援推進本部]]、[[食育推進会議]]、[[少子化社会対策会議]]、[[高齢社会対策会議]]、[[中央交通安全対策会議]]、[[犯罪被害者等施策推進会議]]、[[自殺総合対策会議]]、[[消費者政策会議]]、[[国際平和協力本部]]、[[日本学術会議]]、[[官民人材交流センター]]、[[原子力立地会議]]
|下部組織6 = [[地方支分部局]]
|下部組織概要6 = [[沖縄総合事務局]]
|下部組織7 = [[外局]]等
|下部組織概要7 = [[宮内庁]]、[[公正取引委員会]]、[[国家公安委員会]]、[[金融庁]]、[[消費者庁]]
|下部組織8 = 
|下部組織概要8 = 
|下部組織9 = 
|下部組織概要9 = 
|下部組織10 = 
|下部組織概要10 = 
|所在地 = [[東京都]][[千代田区]][[永田町]]1-6-1
|定員 = 1万3715人<ref name="定員令"></ref><br/>- 内閣府本府 2360人<br/>- 宮内庁 1011人<br/>- 公正取引委員会 799人（事務総局職員）<br/>- 国家公安委員会 7736人（警察庁職員）<br/>- 金融庁 1548人<br/>- 消費者庁 279人
|年間予算 = 1兆4056億4200万円<ref name="予算"></ref>
|会計年度 = 2012
|設置年月日 = [[2001年]]（平成13年）[[1月6日]]
|改称年月日 = 
|前身 = [[総理府]]、[[経済企画庁]]、[[沖縄開発庁]]等
|ウェブサイト = [http://www.cao.go.jp/index.html 内閣府HP]
|その他 = 
}}
TEXT


parser = InfoParser.new("ja")
useful_type, infobox_type, infobox_properties = parser.get_infobox(infobox3)
puts useful_type
puts infobox_type
puts infobox_properties.to_s